ci_app1/app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `property`
SELECT COUNT(*) AS `numrows`
FROM `services`
SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT COUNT(*) AS `numrows`
FROM `types`
SELECT COUNT(*) AS `numrows`
FROM `orders`
---
    public function index(): string
    {
        $totalProperty = $this->property->countAllResults();
        $totalService = $this->service->countAllResults();
        $totalCategory = $this->category->countAllResults();
        $totalType = $this->type->countAllResults();
        $totalOrder = $this->order->countAllResults();