ci_app1/app/Controllers/PropertyController.php

    public function index()
    {
        $this->property->join('categories', 'categories.c_id= property.category_id');
        $this->property->join('types', 'types.t_id= property.type_id');
        $this->property->join('statuses', 'statuses.s_id= property.status_id');
        $data['items'] = $this->property->findAll();
---
SELECT *
FROM `property`
JOIN `categories` ON `categories`.`c_id`= `property`.`category_id`
JOIN `types` ON `types`.`t_id`= `property`.`type_id`
JOIN `statuses` ON `statuses`.`s_id`= `property`.`status_id`

    public function add()
    {
        $data['cats'] = $this->category->findAll();
        $data['types'] = $this->type->findAll();
        $data['status'] = $this->status->findAll();
---
SELECT *
FROM `categories`
SELECT *
FROM `types`
SELECT *
FROM `statuses`