ci_app1/app/Controllers/ServiceController.php

SELECT *
FROM `services`
---
    public function index()
    {
        $data['items'] = $this->service->findAll();